# Filtering and Ordering - Lab

For the old version of this lab go [here](https://github.com/learn-co-curriculum/dsc-1-05-08-filtering-and-ordering-lab-old).

## Introduction
In this lab, we will write more `SELECT` statements to solidify our ability to query a SQL database.  We will also write more specific queries using the tools we learned in the previous lesson.

## Objectives
You will be able to:
* Limit the number of records returned by a query using `LIMIT`
* Filter results using `BETWEEN` and `IS NULL`
* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)

### Famous Dogs

We have a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

First, import sqlite3 and establish a connection to the database **dogs.db**. Then, create a cursor object so that you can pass SQL queries to the database.

In [11]:
#Your code here; import sqlite, create a connection and then a cursor object.
import pandas as pd
import sqlite3 
connection = sqlite3.connect('dogs.db')
cur = connection.cursor()

## Review

As a quick review, here's the code we used to generate this table:

```
cur.execute("""CREATE TABLE dogs (id INTEGER PRIMARY KEY,
                                   name TEXT, age INTEGER,
                                   gender CHAR(1),
                                   breed TEXT,
                                   temperament TEXT,
                                   hungry BOOLEAN);""")

cur.execute("""INSERT INTO dogs (name, age, gender, breed, temperament, hungry) VALUES
                ("Snoopy", 3, "M", "beagle", "friendly", 1),
                ("McGruff", 10, "M", "bloodhound", "aware", 0),
                ("Scooby", 6, "M", "great dane", "hungry", 1),
                ("Little Ann", 5, "F", "coonhound", "loyal", 0),
                ("Pickles", 13, "F", "black lab", "mischievous", 1),
                ("Clifford", 4, "M", "big red", "smiley", 1),
                ("Lassie", 7, "F", "collie", "loving", 1),
                ("Snowy", 8, "F", "fox terrier", "adventurous", 0),
                (NULL, 4, "M", "golden retriever", "playful", 1);""")
conn.commit() #Save our changes to the database
```

## Queries

Display the outputs for each of the following query descriptions.

* Select the name and breed for all female dogs

In [14]:
#Your code here
cur.execute("""SELECT name, breed FROM dogs WHERE gender=='F';""").fetchall()

[('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

In [28]:
#Demonstrating running a query and previewing results as pandas DataFrame
results = cur.execute("""select * from dogs;""").fetchall()

#Alternatively we could do this in two steps:
#cur.execute("""select * from planets;""")
#results = cur.fetchall()
df = pd.DataFrame(results)
df. columns = [i[0] for i in cur.description]
df

def sql_select_to_df(SQL_COMMAND, cur=cur):
    results = cur.execute(SQL_COMMAND).fetchall()
    df = pd.DataFrame(results)
    df.columns = [i[0] for i in cur.description]
    return df

df = sql_select_to_df("""select * from dogs;""")
df

   id        name  age gender             breed  temperament  hungry
0   1      Snoopy    3      M            beagle     friendly       1
1   2     McGruff   10      M        bloodhound        aware       0
2   3      Scooby    6      M        great dane       hungry       1
3   4  Little Ann    5      F         coonhound        loyal       0
4   5     Pickles   13      F         black lab  mischievous       1
5   6    Clifford    4      M           big red       smiley       1
6   7      Lassie    7      F            collie       loving       1
7   8       Snowy    8      F       fox terrier  adventurous       0
8   9        None    4      M  golden retriever      playful       1

* Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

In [21]:
#Your code here
cursor.execute('''SELECT name FROM dogs ORDER BY name;''').fetchall()

[(None,),
 ('Clifford',),
 ('Lassie',),
 ('Little Ann',),
 ('McGruff',),
 ('Pickles',),
 ('Scooby',),
 ('Snoopy',),
 ('Snowy',)]

* Select any dog that doesn't have a name

In [23]:
#Your code here
cursor.execute('''SELECT * FROM dogs WHERE name IS NULL;''').fetchall()

[(9, None, 4, 'M', 'golden retriever', 'playful', 1)]

* Select the name and breed of only the hungry dogs and lists them from youngest to oldest

In [29]:
#Your code here
cursor.execute('''SELECT Name,age, breed FROM dogs  WHERE hungry=1  ORDER BY age ;''').fetchall()

[('Snoopy', 3, 'beagle'),
 ('Clifford', 4, 'big red'),
 (None, 4, 'golden retriever'),
 ('Scooby', 6, 'great dane'),
 ('Lassie', 7, 'collie'),
 ('Pickles', 13, 'black lab')]

* Select the oldest dog's name, age, and temperament

In [32]:
#Your code here
cursor.execute('''SELECT Name,age, temperament FROM dogs ORDER BY age DESC ;''').fetchone()

('Pickles', 13, 'mischievous')

* Select the three youngest dogs

In [37]:
#Your code here
cursor.execute('''SELECT Name, age FROM dogs ORDER BY age LIMIT 3;''').fetchall()

[('Snoopy', 3), ('Clifford', 4), (None, 4)]

* Select the name and breed of only the dogs who are between five and ten years old

In [38]:
#Your code here
cursor.execute('''SELECT Name,breed FROM dogs  WHERE age BETWEEN 5 AND 10;''').fetchall()

[('McGruff', 'bloodhound'),
 ('Scooby', 'great dane'),
 ('Little Ann', 'coonhound'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier')]

* Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [43]:
#Your code here

cursor.execute('''SELECT Name,age FROM dogs  WHERE  hungry=1 AND age BETWEEN 2 AND 7 ORDER BY name ;''').fetchall()

[(None, 4), ('Clifford', 4), ('Lassie', 7), ('Scooby', 6), ('Snoopy', 3)]

## Summary

Great work! In this lab we practiced writing more complex SQL statements to not only query specific information but also define the quantity of results and the order of our results.